content/_cv.md
+++
title = "Curriculum Vitae"
author = ["Pavel Korytov"]
draft = false
norss = true
private = true
+++

## Contact Details {#contact-details}

**Pavel V. Korytov**

-   e-mail: [thexcloud@gmail.com](mailto:thexcloud@gmail.com) (personal), [pvkorytov@etu.ru](mailto:pvkorytov@etu.ru) (corporate)
-   GitHub: [https://github.com/SqrtMinusOne](https://github.com/SqrtMinusOne)
-   Mastodon: [https://emacs.ch/@sqrtminusone](https://emacs.ch/@sqrtminusone)
-   Telegram: [https://t.me/SqrtMinusTwo](https://t.me/SqrtMinusTwo)
-   Location: Saint-Petersburg, Russia


## Summary {#summary}

Current positions:

-   Graduate student of [Saint-Petersburg Electrotechnical University](https://etu.ru/en/university/) (ETU "LETI")
-   Assistant Professor at [Department of Software Engineering and Computer Applications](https://etu.ru/en/study/faculties/faculty-of-computing-technologies-and-informatics/departments/department-of-software-engineering-and-computer-applications)
-   Full-stack developer at Information Systems Department.

Developing information systems for the university. Conducting research on the intersection of Natural Language Processing methods and Recommender Systems and teaching students in the meantime.


## Education {#education}

**Pursuing a degree of Candidate of Engineering Sciences** (2022 - current)
<div class="table-no-header">

| Specialty          | 2.3.5 Mathematical and Software Support For Computer Systems, Complexes and Computer Networks |
|--------------------|-----------------------------------------------------------------------------------------------|
| Supervisor         | Ivan I. Kholod                                                                                |
| Department         | Department of Information Systems                                                             |
| Faculty            | Faculty of Computer Science and Technology                                                    |
| Dissertation title | Examination of Application of Federated Learning For Text Analysis in Recommender Systems     |

</div>

<hr />

**Master's Degree** (2020 - 2022)
<div class="table-no-header">

| Specialty    | 09.04.04 Software Engineering                                              |
|--------------|----------------------------------------------------------------------------|
| Department   | Department of Software Engineering and Computer Applications               |
| Faculty      | Faculty of Computer Science and Technology                                 |
| Thesis title | Application of Text Analysis Methods to Recommend Educational Trajectories |

</div>

<hr />

**Bachelor's Degree** (2016 - 2020)
<div class="table-no-header">

| Specialty    | 09.03.04 Software Engineering                                               |
|--------------|-----------------------------------------------------------------------------|
| Department   | Department of Software Engineering and Computer Applications                |
| Faculty      | Faculty of Computer Science and Technology                                  |
| Thesis title | Development of the Software of Generation of Data Accounting System Mockups |

</div>


## Professional History {#professional-history}

**Full-stack developer at Information Systems Department of ETU "LETI"** (2020 - current)

Digitalizing processes in the university in a team of ~10 colleagues (currently 12).

My responsibilities involve: database &amp; architecture design, back- (primarily) and frontend development, deployment work, assisting/directing other developers, some analytical work.

All the systems are available at [https://digital.etu.ru/main/.](https://digital.etu.ru/main/)

<hr />

**Assistant Professor at Department of Software Engineering and Computer Applications of ETU "LETI"** (2023 - current)

Teaching courses to students (I started earlier than I got the position):

-   Databases (2021 - current): lectures on the database design theory, SQL, ORMs, etc.
-   DevOps (2023 - current): mostly checking student works on Docker &amp; CI/CD.

Currently an acting supervisor for 3 students (1 bachelor's and 2 master's); 5 in total so far.


## Open Source Work {#open-source-work}

-   I authored 13 packages for [GNU Emacs](https://www.gnu.org/software/emacs/) (see [My Emacs Packages](https://sqrtminusone.xyz/emacs-packages/)), 10 of which are available in [MELPA](https://melpa.org/#/)
-   I maintain several bridges in the [RSS Bridge](https://github.com/RSS-Bridge/rss-bridge) project


## Skills {#skills}

-   **Languages**: <span class="underline">Russian</span> (native), <span class="underline">English</span> (~B2/C1)
-   **RDBMS**:
    -   Primarily: <span class="underline">PostgreSQL</span>
    -   Also worked with: <span class="underline">SQLite</span>, <span class="underline">MySQL</span>, <span class="underline">MariaDB</span>, <span class="underline">MSSQL</span>
-   **NoSQL**:
    -   Primarily: <span class="underline">Redis</span>, <span class="underline">Apache Drill</span>
    -   Also worked with: <span class="underline">MongoDB</span>, <span class="underline">Neo4j</span>
-   **OLAP**: <span class="underline">ClickHouse</span>; also worked with <span class="underline">Apache Druid</span>
-   **Programming languages**:
    -   Primarily: <span class="underline">Python</span>, <span class="underline">JavaScript</span>, <span class="underline">TypeScript</span>, <span class="underline">HTML/CSS</span>, <span class="underline">Emacs Lisp</span>
    -   Also worked with: <span class="underline">C</span>, <span class="underline">C++ (Qt)</span>, <span class="underline">PHP</span>, <span class="underline">Java 8</span>, <span class="underline">MASM</span>, <span class="underline">HLASM</span>, <span class="underline">Clojure</span>, <span class="underline">Scheme</span>, <span class="underline">Hy</span>, <span class="underline">GNU Octave</span>
-   **Technologies/Frameworks**:
    -   ORMs: <span class="underline">Sequelize</span> (node.js), <span class="underline">SQLAlchemy</span> (Python)
    -   Backend: <span class="underline">express.js</span>, <span class="underline">nest.js</span>, <span class="underline">Flask</span> (Python)
    -   Frontend: <span class="underline">Vue.js</span>, <span class="underline">Bootstrap</span>, <span class="underline">Sass</span>
    -   Data processing: <span class="underline">numpy</span>, <span class="underline">pandas</span>, <span class="underline">matplotlib</span>, <span class="underline">streamlit</span>
    -   ML: <span class="underline">scikit-learn</span>, <span class="underline">spacy</span>; worked with <span class="underline">pytorch</span>, <span class="underline">transformers</span>
    -   Cloud services: <span class="underline">Yandex.Cloud</span>
    -   Misc: <span class="underline">LaTeX</span>, <span class="underline">GNU Emacs</span>, <span class="underline">GNU Guix</span>
-   **DevOps**:
    -   Web server: <span class="underline">nginx</span>
    -   CI/CD: <span class="underline">Jenkins</span>, <span class="underline">GitHub Actions</span>, <span class="underline">GitLab Actions</span>
    -   Monitoring/Analytics: <span class="underline">Prometheus</span>, <span class="underline">Grafana</span>, <span class="underline">Metabase</span>
    -   Misc: <span class="underline">Docker</span>, <span class="underline">POSIX shell</span> &amp; <span class="underline">bash</span>

Soft skills:

-   Experience in working with students, individually and in groups
-   Supervising development work
-   Communication with customers and stakeholders, figuring out technical requirements


## Publications {#publications}

-   <div class="text-ru"> А. Н. Матвеев and П. В. Корытов, “Описание разработки микросервиса для семантического сопоставления текстов,” in Сборник XI конференции “Наука настоящего и будущего,” СПб.: СПбГЭТУ «ЛЭТИ», 2023, pp. 216–262. </div>
-   I. I. Kholod, P. V. Korytov, and M. V. Sorochina, “Application of Neural Network Keyword Extraction Methods for Student’s CV Compilation from Discipline Work Programs,” in 2023 XXVI International Conference on Soft Computing and Measurements (SCM), СПб.: IEEE, May 2023, pp. 143–146. doi: 10.1109/SCM58628.2023.10159061.
-   P. V. Korytov and I. I. Kholod, “Application of Text Analysis Methods to Recommend Student Choices,” in 2022 XXV International Conference on Soft Computing and Measurements (SCM), СПб.: IEEE, May 2022, pp. 107–110. doi: 10.1109/SCM55405.2022.9794830.
-   R. R. Fatkieva and P. V. Korytov, “Assessment of Applicability of Discrete Situational Networks for Information Transmission in Intelligent Transport Networks,” Autom. Doc. Math. Linguist., vol. 56, no. 2, pp. 70–75, Apr. 2022, doi: 10.3103/S0005105522020029.
-   <div class="text-ru"> М. О. Доброхвалов, П. В. Корытов, С. И. Степанова, А. А. Тарасова, and Ар. Ю. Филатов, “Анализ подходов к моделированию систем  массового обслуживания,” Известия ЛЭТИ, vol. 5, pp. 56–64, 2021. </div>
-   I. I. Kholod, M. V. Kovynev, I. S. Grigoriev, and P. V. Korytov, “Developing a single sign-on for information systems,” Software Journal: Theory and Applications, vol. 3, 2021.
-   <div class="text-ru"> И. И. Холод, В. С. Иванов, И. С. Григорьев, П. В. Корытов, and М. В. Ковынев, “Опыт автоматизации процесса составления расписания в вузе,” Cloud of Science, vol. 7, no. 4, pp. 844–865, 2020. </div>
-   <div class="text-ru"> П. В. Корытов and С. А. Беляев, “Опыт создания программы автоматической  генерации web-приложений по формальным требованиям,” Cloud of Science, vol. 7, no. 3, pp. 559–576, 2020. </div>
-   G. O. Medvedev, D. M. Klionskiy, N. V. Razmochaeva, and P. V. Korytov, “Investigation of Distance Digital Signal Processing Courses based on Modern Programming Languages,” in 2020 9th Mediterranean Conference on Embedded Computing (MECO), Budva, Montenegro: IEEE, Jun. 2020, pp. 1–4. doi: 10.1109/MECO49872.2020.9134327.
-   P. V. Korytov, S. A. Belyaev, A. V. Ekalo, and E. V. Postnikov, “Development of the Program for Creating Data Accounting Software Systems Mockups,” in 2020 IEEE Conference of Russian Young Researchers in Electrical and Electronic Engineering (EIConRus), СПб.: IEEE, Jan. 2020, pp. 359–362. doi: 10.1109/EIConRus49466.2020.9039515.


## Other Interests {#other-interests}

My layperson interests include, in no particular order: philosophy of AI, philosophy of rationality and cognitive biases, workings of evolution, eastern religions.

I love the Making Sense podcast.
